hpmicro/rtt-bsp-hpm6750evkmini/common/rt-thread/libcpu/mips/common/mips_regs.h
/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2019-12-04     Jiaxun Yang  Initial version
 */

#ifndef _MIPS_REGS_H_
#define _MIPS_REGS_H_
#include <rtconfig.h>
#define REG_A0  4
#define REG_SP  29
#define REG_GP  28
#define REG_FP  30
#define REG_RA  31

#ifndef ARCH_MIPS64
#define zero    $0  /* wired zero */
#define AT  $1  /* assembler temp  - uppercase because of ".set at" */
#define v0  $2  /* return value */
#define v1  $3
#define a0  $4  /* argument registers */
#define a1  $5
#define a2  $6
#define a3  $7
#define t0  $8  /* caller saved */
#define t1  $9
#define t2  $10
#define t3  $11
#define t4  $12
#define ta0 $12
#define t5  $13
#define ta1 $13
#define t6  $14
#define ta2 $14
#define t7  $15
#define ta3 $15
#define s0  $16 /* callee saved */
#define s1  $17
#define s2  $18
#define s3  $19
#define s4  $20
#define s5  $21
#define s6  $22
#define s7  $23
#define t8  $24 /* caller saved */
#define t9  $25
#define jp  $25 /* PIC jump register */
#define k0  $26 /* kernel scratch */
#define k1  $27
#define gp  $28 /* global pointer */
#define sp  $29 /* stack pointer */
#define fp  $30 /* frame pointer */
#define s8  $30 /* same like fp! */
#define ra  $31 /* return address */

#else

#define zero    $0  /* wired zero */
#define AT  $at /* assembler temp - uppercase because of ".set at" */
#define v0  $2  /* return value - caller saved */
#define v1  $3
#define a0  $4  /* argument registers */
#define a1  $5
#define a2  $6
#define a3  $7
#define a4  $8  /* arg reg 64 bit; caller saved in 32 bit */
#define ta0 $8
#define a5  $9
#define ta1 $9
#define a6  $10
#define ta2 $10
#define a7  $11
#define ta3 $11
#define t0  $12 /* caller saved */
#define t1  $13
#define t2  $14
#define t3  $15
#define s0  $16 /* callee saved */
#define s1  $17
#define s2  $18
#define s3  $19
#define s4  $20
#define s5  $21
#define s6  $22
#define s7  $23
#define t8  $24 /* caller saved */
#define t9  $25 /* callee address for PIC/temp */
#define jp  $25 /* PIC jump register */
#define k0  $26 /* kernel temporary */
#define k1  $27
#define gp  $28 /* global pointer - caller saved for PIC */
#define sp  $29 /* stack pointer */
#define fp  $30 /* frame pointer */
#define s8  $30 /* callee saved */
#define ra  $31 /* return address */

#endif

#define fv0 $f0  /* return value */
#define fv0f    $f1
#define fv1 $f2
#define fv1f    $f3
#define fa0 $f12     /* argument registers */
#define fa0f    $f13
#define fa1 $f14
#define fa1f    $f15
#define ft0 $f4  /* caller saved */
#define ft0f    $f5
#define ft1 $f6
#define ft1f    $f7
#define ft2 $f8
#define ft2f    $f9
#define ft3 $f10
#define ft3f    $f11
#define ft4 $f16
#define ft4f    $f17
#define ft5 $f18
#define ft5f    $f19
#define fs0 $f20     /* callee saved */
#define fs0f    $f21
#define fs1 $f22
#define fs1f    $f23
#define fs2 $f24
#define fs2f    $f25
#define fs3 $f26
#define fs3f    $f27
#define fs4 $f28
#define fs4f    $f29
#define fs5 $f30
#define fs5f    $f31

#define fcr31   $31  /* FPU status register */


/*
 * The following macros are especially useful for __asm__
 * inline assembler.
 */
#ifndef __STR
#define __STR(x) #x
#endif
#ifndef STR
#define STR(x) __STR(x)
#endif

/*
 *  Configure language
 */
#ifdef __ASSEMBLY__
#define _ULCAST_
#else
#define _ULCAST_ (unsigned long)
#endif

/*
 * Coprocessor 0 register names
 */
#define CP0_INDEX $0
#define CP0_RANDOM $1
#define CP0_ENTRYLO0 $2
#define CP0_ENTRYLO1 $3
#define CP0_CONF $3
#define CP0_CONTEXT $4
#define CP0_PAGEMASK $5
#define CP0_WIRED $6
#define CP0_INFO $7
#define CP0_BADVADDR $8
#define CP0_COUNT $9
#define CP0_ENTRYHI $10
#define CP0_COMPARE $11
#define CP0_STATUS $12
#define CP0_CAUSE $13
#define CP0_EPC $14
#define CP0_PRID $15
#define CP0_CONFIG $16
#define CP0_LLADDR $17
#define CP0_WATCHLO $18
#define CP0_WATCHHI $19
#define CP0_XCONTEXT $20
#define CP0_FRAMEMASK $21
#define CP0_DIAGNOSTIC $22
#define CP0_DEBUG $23
#define CP0_DEPC $24
#define CP0_PERFORMANCE $25
#define CP0_ECC $26
#define CP0_CACHEERR $27
#define CP0_TAGLO $28
#define CP0_TAGHI $29
#define CP0_ERROREPC $30
#define CP0_DESAVE $31

/*
 * R4640/R4650 cp0 register names.  These registers are listed
 * here only for completeness; without MMU these CPUs are not useable
 * by Linux.  A future ELKS port might take make Linux run on them
 * though ...
 */
#define CP0_IBASE $0
#define CP0_IBOUND $1
#define CP0_DBASE $2
#define CP0_DBOUND $3
#define CP0_CALG $17
#define CP0_IWATCH $18
#define CP0_DWATCH $19

/*
 * Coprocessor 0 Set 1 register names
 */
#define CP0_S1_DERRADDR0  $26
#define CP0_S1_DERRADDR1  $27
#define CP0_S1_INTCONTROL $20

/*
 *  TX39 Series
 */
#define CP0_TX39_CACHE  $7

/*
 * Coprocessor 1 (FPU) register names
 */
#define CP1_REVISION    $0
#define CP1_UFR     $1
#define CP1_UNFR    $4
#define CP1_FCCR    $25
#define CP1_FEXR    $26
#define CP1_FENR    $28
#define CP1_STATUS  $31


/*
 * Bits in the MIPS32/64 coprocessor 1 (FPU) revision register.
 */
#define MIPS_FPIR_S     (_ULCAST_(1) << 16)
#define MIPS_FPIR_D     (_ULCAST_(1) << 17)
#define MIPS_FPIR_PS        (_ULCAST_(1) << 18)
#define MIPS_FPIR_3D        (_ULCAST_(1) << 19)
#define MIPS_FPIR_W     (_ULCAST_(1) << 20)
#define MIPS_FPIR_L     (_ULCAST_(1) << 21)
#define MIPS_FPIR_F64       (_ULCAST_(1) << 22)
#define MIPS_FPIR_HAS2008   (_ULCAST_(1) << 23)
#define MIPS_FPIR_UFRP      (_ULCAST_(1) << 28)
#define MIPS_FPIR_FREP      (_ULCAST_(1) << 29)

/*
 * Bits in the MIPS32/64 coprocessor 1 (FPU) condition codes register.
 */
#define MIPS_FCCR_CONDX_S   0
#define MIPS_FCCR_CONDX     (_ULCAST_(255) << MIPS_FCCR_CONDX_S)
#define MIPS_FCCR_COND0_S   0
#define MIPS_FCCR_COND0     (_ULCAST_(1) << MIPS_FCCR_COND0_S)
#define MIPS_FCCR_COND1_S   1
#define MIPS_FCCR_COND1     (_ULCAST_(1) << MIPS_FCCR_COND1_S)
#define MIPS_FCCR_COND2_S   2
#define MIPS_FCCR_COND2     (_ULCAST_(1) << MIPS_FCCR_COND2_S)
#define MIPS_FCCR_COND3_S   3
#define MIPS_FCCR_COND3     (_ULCAST_(1) << MIPS_FCCR_COND3_S)
#define MIPS_FCCR_COND4_S   4
#define MIPS_FCCR_COND4     (_ULCAST_(1) << MIPS_FCCR_COND4_S)
#define MIPS_FCCR_COND5_S   5
#define MIPS_FCCR_COND5     (_ULCAST_(1) << MIPS_FCCR_COND5_S)
#define MIPS_FCCR_COND6_S   6
#define MIPS_FCCR_COND6     (_ULCAST_(1) << MIPS_FCCR_COND6_S)
#define MIPS_FCCR_COND7_S   7
#define MIPS_FCCR_COND7     (_ULCAST_(1) << MIPS_FCCR_COND7_S)

