hpmicro/rtt-bsp-hpm6750evkmini/common/rt-thread/libcpu/mips/common/mips_regs.h
/*
 * Bits in the MIPS32/64 coprocessor 1 (FPU) enables register.
 */
#define MIPS_FENR_FS_S      2
#define MIPS_FENR_FS        (_ULCAST_(1) << MIPS_FENR_FS_S)

/*
 * FPU Status Register Values
 */
#define FPU_CSR_COND_S  23                  /* $fcc0 */
#define FPU_CSR_COND    (_ULCAST_(1) << FPU_CSR_COND_S)

#define FPU_CSR_FS_S    24      /* flush denormalised results to 0 */
#define FPU_CSR_FS  (_ULCAST_(1) << FPU_CSR_FS_S)

#define FPU_CSR_FO      0x00400000
#define FPU_CSR_FN      0x00200000

#define FPU_CSR_CONDX_S 25                  /* $fcc[7:1] */
#define FPU_CSR_CONDX   (_ULCAST_(127) << FPU_CSR_CONDX_S)
#define FPU_CSR_COND1_S 25                  /* $fcc1 */
#define FPU_CSR_COND1   (_ULCAST_(1) << FPU_CSR_COND1_S)
#define FPU_CSR_COND2_S 26                  /* $fcc2 */
#define FPU_CSR_COND2   (_ULCAST_(1) << FPU_CSR_COND2_S)
#define FPU_CSR_COND3_S 27                  /* $fcc3 */
#define FPU_CSR_COND3   (_ULCAST_(1) << FPU_CSR_COND3_S)
#define FPU_CSR_COND4_S 28                  /* $fcc4 */
#define FPU_CSR_COND4   (_ULCAST_(1) << FPU_CSR_COND4_S)
#define FPU_CSR_COND5_S 29                  /* $fcc5 */
#define FPU_CSR_COND5   (_ULCAST_(1) << FPU_CSR_COND5_S)
#define FPU_CSR_COND6_S 30                  /* $fcc6 */
#define FPU_CSR_COND6   (_ULCAST_(1) << FPU_CSR_COND6_S)
#define FPU_CSR_COND7_S 31                  /* $fcc7 */
#define FPU_CSR_COND7   (_ULCAST_(1) << FPU_CSR_COND7_S)

/*
 * Bits 22:20 of the FPU Status Register will be read as 0,
 * and should be written as zero.
 */
#define FPU_CSR_RSVD    (_ULCAST_(7) << 20)

#define FPU_CSR_ABS2008 (_ULCAST_(1) << 19)
#define FPU_CSR_NAN2008 (_ULCAST_(1) << 18)

/*
 * X the exception cause indicator
 * E the exception enable
 * S the sticky/flag bit
*/
#define FPU_CSR_ALL_X   0x0003f000
#define FPU_CSR_UNI_X   0x00020000
#define FPU_CSR_INV_X   0x00010000
#define FPU_CSR_DIV_X   0x00008000
#define FPU_CSR_OVF_X   0x00004000
#define FPU_CSR_UDF_X   0x00002000
#define FPU_CSR_INE_X   0x00001000

#define FPU_CSR_ALL_E   0x00000f80
#define FPU_CSR_INV_E   0x00000800
#define FPU_CSR_DIV_E   0x00000400
#define FPU_CSR_OVF_E   0x00000200
#define FPU_CSR_UDF_E   0x00000100
#define FPU_CSR_INE_E   0x00000080

#define FPU_CSR_ALL_S   0x0000007c
#define FPU_CSR_INV_S   0x00000040
#define FPU_CSR_DIV_S   0x00000020
#define FPU_CSR_OVF_S   0x00000010
#define FPU_CSR_UDF_S   0x00000008
#define FPU_CSR_INE_S   0x00000004

/* Bits 0 and 1 of FPU Status Register specify the rounding mode */
#define FPU_CSR_RM  0x00000003
#define FPU_CSR_RN  0x0 /* nearest */
#define FPU_CSR_RZ  0x1 /* towards zero */
#define FPU_CSR_RU  0x2 /* towards +Infinity */
#define FPU_CSR_RD  0x3 /* towards -Infinity */

#define PM_4K       0x00000000
#define PM_16K      0x00006000
#define PM_64K      0x0001e000
#define PM_256K     0x0007e000
#define PM_1M       0x001fe000
#define PM_4M       0x007fe000
#define PM_16M      0x01ffe000
#define PM_64M      0x07ffe000
#define PM_256M     0x1fffe000


/*
 * Values used for computation of new tlb entries
 */
#define PL_4K       12
#define PL_16K      14
#define PL_64K      16
#define PL_256K     18
#define PL_1M       20
#define PL_4M       22
#define PL_16M      24
#define PL_64M      26
#define PL_256M     28

/*
 * R4x00 interrupt enable / cause bits
 */
#define IE_SW0          (_ULCAST_(1) <<  8)
#define IE_SW1          (_ULCAST_(1) <<  9)
#define IE_IRQ0         (_ULCAST_(1) << 10)
#define IE_IRQ1         (_ULCAST_(1) << 11)
#define IE_IRQ2         (_ULCAST_(1) << 12)
#define IE_IRQ3         (_ULCAST_(1) << 13)
#define IE_IRQ4         (_ULCAST_(1) << 14)
#define IE_IRQ5         (_ULCAST_(1) << 15)

/*
 * R4x00 interrupt cause bits
 */
#define C_SW0           (_ULCAST_(1) <<  8)
#define C_SW1           (_ULCAST_(1) <<  9)
#define C_IRQ0          (_ULCAST_(1) << 10)
#define C_IRQ1          (_ULCAST_(1) << 11)
#define C_IRQ2          (_ULCAST_(1) << 12)
#define C_IRQ3          (_ULCAST_(1) << 13)
#define C_IRQ4          (_ULCAST_(1) << 14)
#define C_IRQ5          (_ULCAST_(1) << 15)

/*
 * Bitfields in the R4xx0 cp0 status register
 */
#define ST0_IE          0x00000001
#define ST0_EXL         0x00000002
#define ST0_ERL         0x00000004
#define ST0_KSU         0x00000018
#  define KSU_USER      0x00000010
#  define KSU_SUPERVISOR    0x00000008
#  define KSU_KERNEL        0x00000000
#define ST0_UX          0x00000020
#define ST0_SX          0x00000040
#define ST0_KX          0x00000080
#define ST0_DE          0x00010000
#define ST0_CE          0x00020000

/*
 * Bitfields in the R[23]000 cp0 status register.
 */
#define ST0_IEC                 0x00000001
#define ST0_KUC         0x00000002
#define ST0_IEP         0x00000004
#define ST0_KUP         0x00000008
#define ST0_IEO         0x00000010
#define ST0_KUO         0x00000020
/* bits 6 & 7 are reserved on R[23]000 */
#define ST0_ISC         0x00010000
#define ST0_SWC         0x00020000
#define ST0_CM          0x00080000

/*
 * Bits specific to the R4640/R4650
 */
#define ST0_UM          (_ULCAST_(1) <<  4)
#define ST0_IL          (_ULCAST_(1) << 23)
#define ST0_DL          (_ULCAST_(1) << 24)


/*
 * Status register bits available in all MIPS CPUs.
 */
#define ST0_IM          0x0000ff00
#define  STATUSB_IP0        8
#define  STATUSF_IP0        (_ULCAST_(1) <<  8)
#define  STATUSB_IP1        9
#define  STATUSF_IP1        (_ULCAST_(1) <<  9)
#define  STATUSB_IP2        10
#define  STATUSF_IP2        (_ULCAST_(1) << 10)
#define  STATUSB_IP3        11
#define  STATUSF_IP3        (_ULCAST_(1) << 11)
#define  STATUSB_IP4        12
#define  STATUSF_IP4        (_ULCAST_(1) << 12)
#define  STATUSB_IP5        13
#define  STATUSF_IP5        (_ULCAST_(1) << 13)
#define  STATUSB_IP6        14
#define  STATUSF_IP6        (_ULCAST_(1) << 14)
#define  STATUSB_IP7        15
#define  STATUSF_IP7        (_ULCAST_(1) << 15)
#define  STATUSB_IP8        0
#define  STATUSF_IP8        (_ULCAST_(1) <<  0)
#define  STATUSB_IP9        1
#define  STATUSF_IP9        (_ULCAST_(1) <<  1)
#define  STATUSB_IP10       2
#define  STATUSF_IP10       (_ULCAST_(1) <<  2)
#define  STATUSB_IP11       3
#define  STATUSF_IP11       (_ULCAST_(1) <<  3)
#define  STATUSB_IP12       4
#define  STATUSF_IP12       (_ULCAST_(1) <<  4)
#define  STATUSB_IP13       5
#define  STATUSF_IP13       (_ULCAST_(1) <<  5)
#define  STATUSB_IP14       6
#define  STATUSF_IP14       (_ULCAST_(1) <<  6)
#define  STATUSB_IP15       7
#define  STATUSF_IP15       (_ULCAST_(1) <<  7)
#define ST0_CH          0x00040000
#define ST0_SR          0x00100000
#define ST0_TS          0x00200000
#define ST0_BEV         0x00400000
#define ST0_RE          0x02000000
#define ST0_FR          0x04000000
#define ST0_CU          0xf0000000
#define ST0_CU0         0x10000000
#define ST0_CU1         0x20000000
#define ST0_CU1_SHIFT           29
#define ST0_CU2         0x40000000
#define ST0_CU3         0x80000000
#define ST0_XX          0x80000000  /* MIPS IV naming */

