hpmicro/rtt-bsp-hpm6750evkmini/common/rt-thread/libcpu/mips/common/mips_regs.h
/*
 * For now use this only with interrupts disabled!
 */
#define read_64bit_cp0_register(source)                         \
({ int __res;                                                   \
        __asm__ __volatile__(                                   \
        ".set\tmips3\n\t"                                       \
        "dmfc0\t%0,"STR(source)"\n\t"                           \
        ".set\tmips0"                                           \
        : "=r" (__res));                                        \
        __res;})

#define write_32bit_cp0_register(register,value)                \
        __asm__ __volatile__(                                   \
        "mtc0\t%0,"STR(register)"\n\t"              \
    "nop"                           \
        : : "r" (value));

#define write_32bit_cp0_set1_register(register,value)           \
        __asm__ __volatile__(                                   \
        "ctc0\t%0,$"STR(register)"\n\t"             \
    "nop"                           \
        : : "r" (value));

#define write_64bit_cp0_register(register,value)                \
        __asm__ __volatile__(                                   \
        ".set\tmips3\n\t"                                       \
        "dmtc0\t%0,"STR(register)"\n\t"                         \
        ".set\tmips0"                                           \
        : : "r" (value))

/*
 * This should be changed when we get a compiler that support the MIPS32 ISA.
 */
#define read_mips32_cp0_config1()                               \
({ int __res;                                                   \
        __asm__ __volatile__(                                   \
    ".set\tnoreorder\n\t"                                   \
    ".set\tnoat\n\t"                                        \
    "#.set\tmips64\n\t"                 \
    "#mfc0\t$1, $16, 1\n\t"                 \
    "#.set\tmips0\n\t"                  \
         ".word\t0x40018001\n\t"                                 \
    "move\t%0,$1\n\t"                                       \
    ".set\tat\n\t"                                          \
    ".set\treorder"                                         \
    :"=r" (__res));                                         \
        __res;})

#endif
/*
 * Macros to access the floating point coprocessor control registers
 */
#define read_32bit_cp1_register(source)                         \
({ int __res;                                                   \
    __asm__ __volatile__(                                   \
    ".set\tpush\n\t"                    \
    ".set\treorder\n\t"                 \
        "cfc1\t%0,$"STR(source)"\n\t"                            \
    ".set\tpop"                     \
        : "=r" (__res));                                        \
        __res;})

#define write_32bit_cp1_register(register,value)                \
        __asm__ __volatile__(                                   \
        "ctc1\t%0,$"STR(register)"\n\t"             \
    "nop"                           \
        : : "r" (value));

/* TLB operations. */
static inline void tlb_probe(void)
{
    __asm__ __volatile__(
        ".set noreorder\n\t"
        "tlbp\n\t"
        ".set reorder");
}

static inline void tlb_read(void)
{
    __asm__ __volatile__(
        ".set noreorder\n\t"
        "tlbr\n\t"
        ".set reorder");
}

static inline void tlb_write_indexed(void)
{
    __asm__ __volatile__(
        ".set noreorder\n\t"
        "tlbwi\n\t"
        ".set reorder");
}

static inline void tlb_write_random(void)
{
    __asm__ __volatile__(
        ".set noreorder\n\t"
        "tlbwr\n\t"
        ".set reorder");
}

/*
 * Manipulate bits in a c0 register.
 */
#define __BUILD_SET_C0(name,register)               \
static inline unsigned int                  \
set_c0_##name(unsigned int set)                 \
{                               \
    unsigned int res;                   \
                                \
    res = read_c0_##name();                 \
    res |= set;                     \
    write_c0_##name(res);                   \
                                \
    return res;                     \
}                               \
                                \
static inline unsigned int                  \
clear_c0_##name(unsigned int clear)             \
{                               \
    unsigned int res;                   \
                                \
    res = read_c0_##name();                 \
    res &= ~clear;                      \
    write_c0_##name(res);                   \
                                \
    return res;                     \
}                               \
                                \
static inline unsigned int                  \
change_c0_##name(unsigned int change, unsigned int new)     \
{                               \
    unsigned int res;                   \
                                \
    res = read_c0_##name();                 \
    res &= ~change;                     \
    res |= (new & change);                  \
    write_c0_##name(res);                   \
                                \
    return res;                     \
}

__BUILD_SET_C0(status,CP0_STATUS)
__BUILD_SET_C0(cause,CP0_CAUSE)
__BUILD_SET_C0(config,CP0_CONFIG)

#define set_cp0_status(x)   set_c0_status(x)
#define set_cp0_cause(x)    set_c0_cause(x)
#define set_cp0_config(x)   set_c0_config(x)

#define read_c1_status()    read_32bit_cp1_register(31)
#define write_c1_status(x)  write_32bit_cp1_register(31, x)

#define readb(reg)      (*((volatile unsigned char *) (reg)))
#define readw(reg)      (*((volatile unsigned short *) (reg)))
#define readl(reg)      (*((volatile unsigned int *) (reg)))

#define writeb(data, reg)   ((*((volatile unsigned char *)(reg))) = (unsigned char)(data))
#define writew(data, reg)   ((*((volatile unsigned short *)(reg))) = (unsigned short)(data))
#define writel(data, reg)   ((*((volatile unsigned int *)(reg))) = (unsigned int)(data))

#endif /* !__ASSEMBLY__ */

#endif /* _MIPS_REGS_H_ */
